<a href="https://colab.research.google.com/github/Wakili35/blue_chilli/blob/main/Assessment_Lois_Wakili.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Hamoye Internship workspace.

**STAGE** **A** - **Fuel** **Data** **Assessment**

In [3]:
# Importing necessary libraries
import statistics
import pandas as pd
import numpy as np
from scipy import stats
import matplotlib.pyplot as plt

In [4]:
# reading in the data from the url given

link = "https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv"
fuel_df = pd.read_csv(link, error_bad_lines = False)

In [5]:
# some summary statistics 

fuel_df.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [6]:
fuel_df.describe(include = 'all')

                       record_id  ...  fuel_cost_per_mmbtu
count                      29523  ...         29523.000000
unique                     29523  ...                  NaN
top     f1_fuel_1995_12_164_0_13  ...                  NaN
freq                           1  ...                  NaN
mean                         NaN  ...            19.304354
std                          NaN  ...          2091.540939
min                          NaN  ...           -41.501000
25%                          NaN  ...             1.940000
50%                          NaN  ...             4.127000
75%                          NaN  ...             7.745000
max                          NaN  ...        359278.000000

[11 rows x 11 columns]

In [7]:
# Viewing uniques values for some specific columns

fuel_df['fuel_type_code_pudl'].unique()

fuel_df['plant_name_ferc1'].unique()

array(['rockport', 'rockport total plant', 'gorgas', ...,
       'airport unit 6', 'wyodak - bhp 20%', 'wygen 3 bhp 52%'],
      dtype=object)

In [8]:
# searching for missing values

fuel_df.isnull().sum()

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [9]:
# viewing the mode of the column with missing values for imputation purposes
fuel_df['fuel_unit'].mode()

0    mcf
dtype: object

In [10]:
# filling the missing values with the mode of 'fuel_unit',  'mcf'

fuel_df[['fuel_unit']] = fuel_df[['fuel_unit']].fillna(value = 'mcf')

In [11]:
fuel_df.groupby('fuel_type_code_pudl')['fuel_cost_per_unit_burned'].mean()

fuel_type_code_pudl
coal         67.421830
gas          13.659397
nuclear    4955.157002
oil         168.877086
other        18.253856
waste        19.518122
Name: fuel_cost_per_unit_burned, dtype: float64

In [12]:
# calulating standard deviation

round(statistics.stdev(fuel_df['fuel_mmbtu_per_unit']), ndigits=2)

10.6

In [13]:
# calculating the 75th percentile

round(np.percentile(fuel_df['fuel_mmbtu_per_unit'],75), ndigits=2)

17.01

In [14]:
# calculating the skewness

round(stats.skew(fuel_df['fuel_qty_burned']), 2)

15.85

In [15]:
# calculating the kurtosis

round(stats.kurtosis(fuel_df['fuel_qty_burned']), 2)

651.26

In [16]:
# reloading and creating a new copy of the dataframe

link = "https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv"
fuel_df_2 = pd.read_csv(link, error_bad_lines = False)

In [17]:
# calculating the percentage of missing values to the whole dataframe

round(((fuel_df_2['fuel_unit'].isnull().sum())/fuel_df_2.shape[0]) * 100, 3)

0.61

In [25]:
# calcualting the correlation for all the columns

fuel_df.corr()

                              utility_id_ferc1  ...  fuel_cost_per_mmbtu
utility_id_ferc1                      1.000000  ...             0.006122
report_year                           0.093323  ...             0.010261
fuel_qty_burned                      -0.057447  ...            -0.001896
fuel_mmbtu_per_unit                  -0.066946  ...            -0.005884
fuel_cost_per_unit_burned            -0.037863  ...            -0.000437
fuel_cost_per_unit_delivered         -0.016414  ...            -0.000109
fuel_cost_per_mmbtu                   0.006122  ...             1.000000

[7 rows x 7 columns]

In [19]:
# make a new subset of data to use for further analysis

new_df = fuel_df[fuel_df['fuel_type_code_pudl'] == 'coal']

In [20]:
new_df.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
5  f1_fuel_1994_12_2_0_13  ...                1.850

[5 rows x 11 columns]

In [21]:
# Grouping the report year column and calculating the total amount of fuel per unit burned

fuel_df.groupby('report_year')['fuel_cost_per_unit_burned'].sum()

report_year
1994    263292.115
1995    425661.488
1996     86425.275
1997    163533.452
1998    140238.656
1999    126056.285
2000    326495.434
2001    180365.641
2002    121921.135
2003    149175.726
2004    184637.699
2005    135924.139
2006    188142.032
2007    256114.312
2008    314312.022
2009    263584.566
2010    331581.467
2011    374175.603
2012    321693.544
2013    306933.236
2014    518002.469
2015    260060.984
2016    255484.814
2017    244557.823
2018    221575.426
Name: fuel_cost_per_unit_burned, dtype: float64

In [22]:
percentage = ((14984.572 - 11902.597) * 100)/14984.572

In [23]:
percentage

20.567654518260518

In [24]:
fuel_df.groupby('report_year')['fuel_cost_per_unit_delivered'].mean()

report_year
1994       63.636060
1995       32.735269
1996     9196.705948
1997    11140.197239
1998      287.154420
1999       25.551627
2000      985.362877
2001       60.050396
2002       47.594361
2003       55.663493
2004      139.524275
2005       41.438184
2006       38.657484
2007       43.325023
2008       58.588197
2009      652.694163
2010       91.862105
2011       59.774667
2012       60.994502
2013      172.307591
2014      192.737183
2015      326.535511
2016      103.901761
2017       46.196861
2018      499.269966
Name: fuel_cost_per_unit_delivered, dtype: float64